app/Http/Controllers/ChartController.php

    public function index(Request $request){
        date_default_timezone_set('Asia/Makassar');

        $tahun=date("Y");

        $bulan=date("m");

        $tidakhadirbulan = att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','2')
            ->count();
        $sakitbulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','5')
            ->count();
        $ijinbulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','3')
            ->count();
        $cutibulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','4')
            ->count();
        $tlbulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','7')
            ->count();
        $tbbulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','6')
            ->count();
        $terlambatbulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.terlambat','!=','00:00:00')
            ->count();
        $eventbulan= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereMonth('atts.tanggal_att', '=', $bulan)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','8')
            ->count();
---
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and month(`atts`.`tanggal_att`) = '05' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '2'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and month(`atts`.`tanggal_att`) = '05' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '5'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and month(`atts`.`tanggal_att`) = '05' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '3'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and month(`atts`.`tanggal_att`) = '05' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '4'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and month(`atts`.`tanggal_att`) = '05' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`terlambat` != '00:00:00'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and month(`atts`.`tanggal_att`) = '05' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '7'

        //     ->whereYear('periode', '=', $tahun)
        //     ->sum('rapatundangan');

        $tidakhadirtahun = att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','2')
            ->count();
        $sakittahun= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','5')
            ->count();
        $ijintahun= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','3')
            ->count();
        $cutitahun= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','4')
            ->count();
---
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`jenisabsen_id` = '3' and `atts`.`tanggal_att` <= '2019-05-16'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '4'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '7'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '6'

            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','7')
            ->count();
        $tbtahun= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','6')
            ->count();
        $terlambattahun= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.terlambat','!=','00:00:00')
            ->count();
        $eventtahun= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->whereYear('atts.tanggal_att', '=', $tahun)
            ->where('atts.jenisabsen_id','=','8')
            ->count();
---
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`tanggal_att` <= '2019-05-16' and `atts`.`jenisabsen_id` = '8'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and year(`atts`.`tanggal_att`) = '2019' and `atts`.`terlambat` != '00:00:00' and `atts`.`tanggal_att` <= '2019-05-16'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and `atts`.`tanggal_att` = '2019-05-16' and `atts`.`jenisabsen_id` = '2'


        $tanggalsekarang=date("Y-m-d");

        $tidakhadir = att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->where('atts.tanggal_att', '=', $tanggalsekarang)
            ->where('atts.jenisabsen_id','=','2')
            ->count();
        $sakit= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->where('atts.tanggal_att', '=', $tanggalsekarang)
            ->where('atts.jenisabsen_id','=','5')
            ->count();
---
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and `atts`.`tanggal_att` = '2019-05-16' and `atts`.`jenisabsen_id` = '6'
select count(*) as aggregate from `atts` left join `pegawais` on `pegawais`.`id` = `atts`.`pegawai_id` where `pegawais`.`instansi_id` = '1' and `atts`.`tanggal_att` = '2019-05-16' and `atts`.`jenisabsen_id` = '8'

            ->where('atts.tanggal_att', '=', $tanggalsekarang)
            ->where('atts.terlambat','!=','00:00:00')
            ->count();
        $event= att::leftJoin('pegawais','pegawais.id','=','atts.pegawai_id')
            ->where('pegawais.instansi_id', '=', Auth::user()->instansi_id)
            ->where('atts.tanggal_att', '=', $tanggalsekarang)
            ->where('atts.jenisabsen_id','=','8')
            ->count();
---
select count(*) as aggregate from `atts` left join `pegawais` on `atts`.`pegawai_id` = `pegawais`.`id` left join `jadwalkerjas` on `jadwalkerjas`.`id` = `atts`.`jadwalkerja_id` left join `instansis` as `instansismasuk` on `instansismasuk`.`id` = `atts`.`masukinstansi_id` left join `instansis` as `instansiskeluar` on `instansiskeluar`.`id` = `atts`.`keluarinstansi_id` left join `jenisabsens` as `keteranganmasuk` on `keteranganmasuk`.`id` = `atts`.`keteranganmasuk_id` left join `jenisabsens` as `keterangankeluar` on `keterangankeluar`.`id` = `atts`.`keterangankeluar_id` left join `jenisabsens` on `atts`.`jenisabsen_id` = `jenisabsens`.`id` where `pegawais`.`instansi_id` = '1' and `atts`.`tanggal_att` = '2019-05-16'